// Задача 3.Даны два целых числа.Вывести на экран большее из них.
int a = 7;
int b = 10;
if(a > b)
{
    Console.WriteLine(a);
}
else
{
    Console.WriteLine(b);
}

